Tekla.Structures.Geometry3d.CoordinateSystem
The CoordinateSystem class defines a coordinate system in space. The system is
defined by an origin, an X-axis and a Y-axis. The Z-axis is the cross product of the X-axis and the Y-axis.
The following example creates a new coordinate system which is used to create a new view.
using System;
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Drawing GADrawing = new GADrawing();
CoordinateSystem CoordinateSystem = new CoordinateSystem(new Point(), new Vector(1, 0, 0), new Vector(0, 1, 0));
View newView = new View(GADrawing.GetSheet(), CoordinateSystem, CoordinateSystem, new AABB(new Point(0, 0), new Point(1000, 1000, 1000)));
}
}

Tekla.Structures.Geometry3d.CoordinateSystem._Origin
The origin of the coordinate system.

Tekla.Structures.Geometry3d.CoordinateSystem._AxisX
The X-axis of the coordinate system.

Tekla.Structures.Geometry3d.CoordinateSystem._AxisY
The Y-axis of the coordinate system.

Tekla.Structures.Geometry3d.CoordinateSystem.Origin
The origin of the coordinate system.

Tekla.Structures.Geometry3d.CoordinateSystem.AxisX
The X-axis of the coordinate system.

Tekla.Structures.Geometry3d.CoordinateSystem.AxisY
The Y-axis of the coordinate system.

Tekla.Structures.Geometry3d.CoordinateSystem.#ctor
Instantiates a coordinate system in the current work plane.

Tekla.Structures.Geometry3d.CoordinateSystem.#ctor(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Vector)
Instantiates a coordinate system with the given origin, X-axis and Y-axis.
Origin: The origin for the coordinate system.
AxisX: The X-axis for the coordinate system.
AxisY: The Y-axis for the coordinate system.